import random

words1 = {'day':'день', 'money':'деньги', 'number':'номер, число','oil':'растительное масло, нефть','part':'часть',
'people':'люди','time':'время, раз','water':'вода','way':'путь, дорога, способ','work':'работа','year':'год','he':'он',
          'she':'она','it':'оно','you':'ты','we':'мы','they':'они','this':'этот','that':'тот',
          'all':'все','many':'много','bad':'плохой','bed':'кровать','good':'хороший, умелый','long':'длинный','kind':'добрый',
          'new':'новый','other':'другой','short':'короткий','tall':'высокий','cat':'кот Пак','dog':'собака','can':'мочь',
          'come':'приходить','do':'делать','find':'находить','get':'получать','go':'идти','have':'иметь','know':'знать',
          'like':'нравиться','love':'любить','look':'смотреть','make':'делать, готовить','play':'играть','say':'говорить','see':'видеть',
          'take':'брать, принимать, занимать времени','think':'думать','use':'использовать','want':'хотеть','will':'хотеть в будущем','write':'писать','as':'как',
          'with':'вместе с, с помощью','hot':'горячий, жарко','cold':'холодный','which':'который','each':'каждый','air':'воздух','earth':'земля',
          'cloud':'облако','sun':'солнце','forest':'лес','river':'река','oath':'дыхание','kiss':'поцелуй','end':'конец'}
print(len(words1))

